docs/leets/0435-Non-overlapping-Intervals.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0435. Non-overlapping Intervals</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-05-20
</div>
<div id="content" class="content">
<header>
<h1 class="title">0435. Non-overlapping Intervals</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2df9b33">Problem Overview</a></li>
<li><a href="#org9a49441">Solution Outline</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org2df9b33" class="outline-2">
<h2 id="org2df9b33">Problem Overview</h2>
<div class="outline-text-2" id="text-org2df9b33">
<p>
The problem requires determining the minimum number of intervals to remove from a list of intervals so that the remaining intervals are non-overlapping. 
</p>

<p>
<b><b>Key Points:</b></b>
</p>
<ul class="org-ul">
<li>Each interval is represented as a pair [start, end].</li>
<li>The goal is to minimize the number of intervals removed to ensure no two intervals overlap.</li>
</ul>
</div>
</div>

<div id="outline-container-org9a49441" class="outline-2">
<h2 id="org9a49441">Solution Outline</h2>
<div class="outline-text-2" id="text-org9a49441">
<ol class="org-ol">
<li><b><b>Preferred Structure:</b></b>
<ul class="org-ul">
<li>Utilize sorting and greedy algorithms.</li>
<li>Sort intervals based on their ending times.</li>
</ul></li>

<li><b><b>Brute Force vs Optimal Solution:</b></b>
<ul class="org-ul">
<li><b><b>Brute Force Approach:</b></b> Check all possible subsets of intervals to find the maximum non-overlapping subset. This is computationally expensive (exponential time complexity) and impractical for large inputs.</li>
<li><b><b>Optimal Solution:</b></b> Sort intervals by their end time and then use a greedy approach to select the maximum number of non-overlapping intervals.</li>
</ul></li>

<li><b><b>Algorithm Choice:</b></b>
<ul class="org-ul">
<li><b><b>Greedy Algorithm:</b></b> Sort intervals by their end times. Iterate through intervals, and for each interval, check if it overlaps with the last selected interval. If it doesn't, include it in the selection.</li>
<li>This approach ensures a time complexity of O(n log n) due to sorting and a subsequent O(n) iteration.</li>
</ul></li>
</ol>

<p>
<b><b>Initial Skeleton of the Solution:</b></b>
</p>

<div class="org-src-container">
<pre class="src src-js">  /**
   * Function to find the minimum number of intervals to remove
   * to make the rest non-overlapping.
   * 
   * @param {number[][]} intervals - Array of intervals [start, end]
   * @returns {number} - Minimum number of intervals to remove
   */
  function eraseOverlapIntervals(intervals) {
      let erase = 0;
      for (let i = 0; i &lt; intervals.length; i++) {
          let newIntervals = intervals.filter((el, idx) =&gt; idx !== i);
          // console.log("s" + JSON.stringify(newIntervals));
          if 
      }
      return 0;
  }

  function hasOverlapping(intervals) {
      for (let i = 0; i &lt; intervals.length - 1; i++) {
          for (let n = i + 1; n &lt; intervals.length; n++) {
              if(isOverlapping2(intervals[i]), intervals[n]) {
                  return true;
              }
          }
      }
      return false;
  }

  function isOverlapping2(interval1, interval2) {
    const [start1, end1] = interval1;
    const [start2, end2] = interval2;
    return !(end1 &lt;= start2 || end2 &lt;= start1);
}

  // Test cases
  const testCases = [
      { intervals: [[1, 2], [2, 3], [3, 4], [1, 3]], expected: 1 },
      // { intervals: [[1, 2], [1, 2], [1, 2]], expected: 2 },
      // { intervals: [[1, 2], [2, 3]], expected: 0 },
  ];

  testCases.forEach((test, index) =&gt; {
      const result = eraseOverlapIntervals(test.intervals);
      console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
  });
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
